Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.5.75/Microchip.SAMV70_DFP.pdsc
      <condition id="ATSAMV70J19B">
         <require Dvendor="Microchip:3" Dname="ATSAMV70J19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV70J20">
         <require Dvendor="Microchip:3" Dname="ATSAMV70J20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV70Q20">
         <require Dvendor="Microchip:3" Dname="ATSAMV70Q20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV70Q19B">
         <require Dvendor="Microchip:3" Dname="ATSAMV70Q19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV70N20">
         <require Dvendor="Microchip:3" Dname="ATSAMV70N20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV70J19">
         <require Dvendor="Microchip:3" Dname="ATSAMV70J19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV70N19">
         <require Dvendor="Microchip:3" Dname="ATSAMV70N19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV70N20B">
         <require Dvendor="Microchip:3" Dname="ATSAMV70N20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV70N19B">
         <require Dvendor="Microchip:3" Dname="ATSAMV70N19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV70Q20B">
         <require Dvendor="Microchip:3" Dname="ATSAMV70Q20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMV70J20B">
         <require Dvendor="Microchip:3" Dname="ATSAMV70J20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.5.0" condition="ATSAMV70Q19">
         <description>Headers and startup code for Microchip ATSAMV70Q19</description>
         <files>
            <file condition="C" category="include" name="samv70/include/"/>
            <file condition="C" category="header" name="samv70/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/gcc/startup_samv70q19.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/system_samv70q19.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70/gcc/gcc/samv70q19_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70/gcc/gcc/samv70q19_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70/armcc/armcc/startup_samv70q19.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70/armcc/system_samv70q19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/iar/startup_samv70q19.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/system_samv70q19.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70/iar/config/linker/Microchip/atsamv70q19/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70/iar/config/linker/Microchip/atsamv70q19/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.5.0" condition="ATSAMV70J19B">
         <description>Headers and startup code for Microchip ATSAMV70J19B</description>
         <files>
            <file condition="C" category="include" name="samv70b/include/"/>
            <file condition="C" category="header" name="samv70b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/gcc/startup_samv70j19b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/system_samv70j19b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70b/gcc/gcc/samv70j19b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70b/gcc/gcc/samv70j19b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70b/armcc/armcc/startup_samv70j19b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70b/armcc/system_samv70j19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/iar/startup_samv70j19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/system_samv70j19b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70b/iar/config/linker/Microchip/atsamv70j19b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70b/iar/config/linker/Microchip/atsamv70j19b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.5.0" condition="ATSAMV70J20">
         <description>Headers and startup code for Microchip ATSAMV70J20</description>
         <files>
            <file condition="C" category="include" name="samv70/include/"/>
            <file condition="C" category="header" name="samv70/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/gcc/startup_samv70j20.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/system_samv70j20.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70/gcc/gcc/samv70j20_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70/gcc/gcc/samv70j20_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70/armcc/armcc/startup_samv70j20.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70/armcc/system_samv70j20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/iar/startup_samv70j20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/system_samv70j20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70/iar/config/linker/Microchip/atsamv70j20/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70/iar/config/linker/Microchip/atsamv70j20/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.5.0" condition="ATSAMV70Q20">
         <description>Headers and startup code for Microchip ATSAMV70Q20</description>
         <files>
            <file condition="C" category="include" name="samv70/include/"/>
            <file condition="C" category="header" name="samv70/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/gcc/startup_samv70q20.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/system_samv70q20.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70/gcc/gcc/samv70q20_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70/gcc/gcc/samv70q20_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70/armcc/armcc/startup_samv70q20.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70/armcc/system_samv70q20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/iar/startup_samv70q20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/system_samv70q20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70/iar/config/linker/Microchip/atsamv70q20/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70/iar/config/linker/Microchip/atsamv70q20/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.5.0" condition="ATSAMV70Q19B">
         <description>Headers and startup code for Microchip ATSAMV70Q19B</description>
         <files>
            <file condition="C" category="include" name="samv70b/include/"/>
            <file condition="C" category="header" name="samv70b/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70b/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70b/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/gcc/startup_samv70q19b.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70b/gcc/system_samv70q19b.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70b/gcc/gcc/samv70q19b_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70b/gcc/gcc/samv70q19b_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70b/armcc/armcc/startup_samv70q19b.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70b/armcc/system_samv70q19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/iar/startup_samv70q19b.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70b/iar/system_samv70q19b.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70b/iar/config/linker/Microchip/atsamv70q19b/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70b/iar/config/linker/Microchip/atsamv70q19b/flash.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="4.5.0" condition="ATSAMV70N20">
         <description>Headers and startup code for Microchip ATSAMV70N20</description>
         <files>
            <file condition="C" category="include" name="samv70/include/"/>
            <file condition="C" category="header" name="samv70/include/sam.h"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="samv70/templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="samv70/templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/gcc/startup_samv70n20.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="samv70/gcc/system_samv70n20.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="samv70/gcc/gcc/samv70n20_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="samv70/gcc/gcc/samv70n20_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70/armcc/armcc/startup_samv70n20.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="samv70/armcc/system_samv70n20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/iar/startup_samv70n20.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="samv70/iar/system_samv70n20.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="samv70/iar/config/linker/Microchip/atsamv70n20/sram.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="samv70/iar/config/linker/Microchip/atsamv70n20/flash.icf" attr="config"/>
         </files>
      </component>
